base-case/curiosityFluidsAirfoilMesher/setup4/system/blockMeshDict.org
/*--------------------------------*- C++ -*----------------------------------*\ 
  =========                 | 
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox 
   \    /   O peration     | Website:  https://openfoam.org 
    \  /    A nd           | Version:  6 
     \/     M anipulation  | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 1; 

vertices
(
    (0.0 0.0 0)
    (21.0 -10.0 0)
    (1.874885892508946 -10.0 0)
    (0.0 -10.0 0)
    (-10.0 0.0 0)
    (0.0 10.0 0)
    (1.874885892508946 10.0 0)
    (21.0 10.0 0)
    (21.0 0.1 0)
    (21.0 0.0 0)
    (21.0 -0.1 0)
    (1.014304245739645 0.09897165530504098 0)
    (1.0 0.0 0)
    (1.014304245739645 -0.09897165530504098 0)
    (0.24780224755014243 0.1593111314049223 0)
    (0.25 0.05933528490103346 0)
    (0.25 -0.05933528490103346 0)
    (0.25219775244985754 -0.1593111314049223 0)
    (-0.1 0.0 0)
    (0.0 0.0 1)
    (21.0 -10.0 1)
    (1.874885892508946 -10.0 1)
    (0.0 -10.0 1)
    (-10.0 0.0 1)
    (0.0 10.0 1)
    (1.874885892508946 10.0 1)
    (21.0 10.0 1)
    (21.0 0.1 1)
    (21.0 0.0 1)
    (21.0 -0.1 1)
    (1.014304245739645 0.09897165530504098 1)
    (1.0 0.0 1)
    (1.014304245739645 -0.09897165530504098 1)
    (0.24780224755014243 0.1593111314049223 1)
    (0.25 0.05933528490103346 1)
    (0.25 -0.05933528490103346 1)
    (0.25219775244985754 -0.1593111314049223 1)
    (-0.1 0.0 1)
);

blocks
(
    hex (2 1 10 13 21 20 29 32) (202 94 1) simpleGrading (104.57949428296159 140.40334355566762 140.40334355566762 104.57949428296159 0.009949332311621902 0.009949332311621902 0.009949332311621902 0.009949332311621902 1 1 1 1) 
    hex (3 2 13 17 22 21 32 36) (141 94 1) simpleGrading (0.14893571474929712 0.13159426895162013 0.13159426895162013 0.14893571474929712 0.009954253549838945 0.009949332311621902 0.009949332311621902 0.009954253549838945 1 1 1 1) 
    hex (4 3 17 18 23 22 36 37) (31 94 1) edgeGrading (0.0125 1.25 1.25 0.0125 0.009949332311621902 0.009954253549838945 0.009954253549838945 0.009949332311621902 1 1 1 1) 
    hex (4 18 14 5 23 37 33 24) (94 31 1) edgeGrading (0.009949332311621902 0.009954396846259426 0.009954396846259426 0.009949332311621902 0.0125 1.25 1.25 0.0125 1 1 1 1) 
    hex (14 11 6 5 33 30 25 24) (138 94 1) edgeGrading (0.0957008298206123 0.14893571474929712 0.14893571474929712 0.0957008298206123 100.45812071233337 100.50925717215127 100.50925717215127 100.45812071233337 1 1 1 1) 
    hex (11 8 7 6 30 27 26 25) (202 94 1) simpleGrading (140.40334355566762 104.57949428296159 104.57949428296159 140.40334355566762 100.50925717215127 100.50925717215127 100.50925717215127 100.50925717215127 1 1 1 1) 
    hex (12 9 8 11 31 28 27 30) (202 111 1) simpleGrading (140.40334355566762 224.91177693633554 1) 
    hex (15 12 11 14 34 31 30 33) (138 111 1) egeeGrading (0.5 0.0957008298206123 0.0957008298206123 0.5 224.91177693633554 224.91177693633554 224.91177693633554 224.91177693633554 1 1 1 1) 
    hex (0 15 14 18 19 34 33 37) (31 111 1) edgeGrading (0.8 1.25 1.25 0.8 224.91177693633554 224.91177693633554 224.91177693633554 224.91177693633554 1 1 1 1) 
    hex (18 17 16 0 37 36 35 19) (31 111 1) edgeGrading (1.25 0.8 0.8 1.25 0.004446187805821587 0.004446187805821587 0.004446187805821587 0.004446187805821587 1 1 1 1) 
    hex (17 13 12 16 36 32 31 35) (141 111 1) edgeGrading (0.13159426895162013 0.5 0.5 0.13159426895162013 0.004446187805821587 0.004446187805821587 0.004446187805821587 0.004446187805821587 1 1 1 1) 
    hex (13 10 9 12 32 29 28 31) (202 111 1) simpleGrading (140.40334355566762 0.004446187805821587 1) 
);

edges
(
    polyLine 11 14
    (
        (1.012763245739645 0.09919565530504099 0)
        (1.0080854801639092 0.09987170641665973 0)
        (1.0002923258687864 0.10098991594355965 0)
        (0.9894516682899617 0.10252691308011815 0)
        (0.9756316494942634 0.10445725929283352 0)
        (0.9589179755243136 0.10674710704604935 0)
        (0.939427066261318 0.1093583028381417 0)
        (0.9172764043389225 0.11225248945563272 0)
        (0.8926019195905769 0.11538635679878212 0)
        (0.8655619279507976 0.11871430960844863 0)
        (0.8363230198538433 0.12219403580885412 0)
        (0.8050571137175911 0.12577985881701012 0)
        (0.7719572014790398 0.12942501909018822 0)
        (0.7372233052489358 0.1330855335332995 0)
        (0.7010575694478306 0.1367149195258468 0)
        (0.6636720264368968 0.1402652178090582 0)
        (0.6252848569584759 0.14368779884366695 0)
        (0.5861168204875074 0.14692947582452454 0)
        (0.5463966632091495 0.1499388640978723 0)
        (0.5063445712881329 0.15266052912327815 0)
        (0.4661905065851669 0.1550369824710317 0)
        (0.4261637027198844 0.1570120011394939 0)
        (0.38648542455413964 0.15853051680680608 0)
        (0.3473759042019821 0.15953925294999985 0)
        (0.3090497913836753 0.15998723249461305 0)
        (0.27171768195822754 0.15983271371798427 0)
    )
    polyLine 30 33
    (
        (1.012763245739645 0.09919565530504099 1)
        (1.0080854801639092 0.09987170641665973 1)
        (1.0002923258687864 0.10098991594355965 1)
        (0.9894516682899617 0.10252691308011815 1)
        (0.9756316494942634 0.10445725929283352 1)
        (0.9589179755243136 0.10674710704604935 1)
        (0.939427066261318 0.1093583028381417 1)
        (0.9172764043389225 0.11225248945563272 1)
        (0.8926019195905769 0.11538635679878212 1)
        (0.8655619279507976 0.11871430960844863 1)
        (0.8363230198538433 0.12219403580885412 1)
        (0.8050571137175911 0.12577985881701012 1)
        (0.7719572014790398 0.12942501909018822 1)
        (0.7372233052489358 0.1330855335332995 1)
        (0.7010575694478306 0.1367149195258468 1)
        (0.6636720264368968 0.1402652178090582 1)
        (0.6252848569584759 0.14368779884366695 1)
        (0.5861168204875074 0.14692947582452454 1)
        (0.5463966632091495 0.1499388640978723 1)
        (0.5063445712881329 0.15266052912327815 1)
        (0.4661905065851669 0.1550369824710317 1)
        (0.4261637027198844 0.1570120011394939 1)
        (0.38648542455413964 0.15853051680680608 1)
        (0.3473759042019821 0.15953925294999985 1)
        (0.3090497913836753 0.15998723249461305 1)
        (0.27171768195822754 0.15983271371798427 1)
    )
    polyLine 14 18
    (
        (0.23557015350342608 0.1590373982751534 0)
        (0.20078960229995063 0.1575705263345074 0)
        (0.16754028269648139 0.15540834442167212 0)
        (0.1359535148231966 0.15253090982642223 0)
        (0.10612233994687932 0.14891460605725965 0)
        (0.07809129700718301 0.14452344102586095 0)
        (0.05182366485211293 0.13928727612585823 0)
        (0.02715509374591781 0.1330565013106575 0)
        (0.0037315234793538488 0.12550313719085116 0)
        (-0.019067689998813697 0.11591686014167135 0)
        (-0.042215206773190905 0.10268283512976308 0)
        (-0.06649514722643773 0.08221843354067171 0)
        (-0.08944920554923189 0.048359315438130164 0)
        (-0.0975801584080648 0.021865788004482748 0)
    )
    polyLine 33 37
    (
        (0.23557015350342608 0.1590373982751534 1)
        (0.20078960229995063 0.1575705263345074 1)
        (0.16754028269648139 0.15540834442167212 1)
        (0.1359535148231966 0.15253090982642223 1)
        (0.10612233994687932 0.14891460605725965 1)
        (0.07809129700718301 0.14452344102586095 1)
        (0.05182366485211293 0.13928727612585823 1)
        (0.02715509374591781 0.1330565013106575 1)
        (0.0037315234793538488 0.12550313719085116 1)
        (-0.019067689998813697 0.11591686014167135 1)
        (-0.042215206773190905 0.10268283512976308 1)
        (-0.06649514722643773 0.08221843354067171 1)
        (-0.08944920554923189 0.048359315438130164 1)
        (-0.0975801584080648 0.021865788004482748 1)
    )
    polyLine 18 17
    (
        (-0.08051694497104521 -0.06403024721421276 0)
        (-0.06649514722643773 -0.08221843354067171 0)
        (-0.042215206773190905 -0.10268283512976308 0)
        (-0.019067689998813697 -0.11591686014167135 0)
        (0.0037315234793538488 -0.12550313719085116 0)
        (0.02715509374591781 -0.1330565013106575 0)
        (0.05182366485211293 -0.13928727612585823 0)
        (0.07809129700718301 -0.14452344102586095 0)
        (0.10612233994687932 -0.14891460605725965 0)
        (0.1359535148231966 -0.15253090982642223 0)
        (0.16754028269648139 -0.15540834442167212 0)
        (0.20078960229995063 -0.1575705263345074 0)
        (0.23557015350342608 -0.1590373982751534 0)
    )
    polyLine 37 36
    (
        (-0.08051694497104521 -0.06403024721421276 1)
        (-0.06649514722643773 -0.08221843354067171 1)
        (-0.042215206773190905 -0.10268283512976308 1)
        (-0.019067689998813697 -0.11591686014167135 1)
        (0.0037315234793538488 -0.12550313719085116 1)
        (0.02715509374591781 -0.1330565013106575 1)
        (0.05182366485211293 -0.13928727612585823 1)
        (0.07809129700718301 -0.14452344102586095 1)
        (0.10612233994687932 -0.14891460605725965 1)
        (0.1359535148231966 -0.15253090982642223 1)
        (0.16754028269648139 -0.15540834442167212 1)
        (0.20078960229995063 -0.1575705263345074 1)
        (0.23557015350342608 -0.1590373982751534 1)
    )
    polyLine 17 13
    (
        (0.27171768195822754 -0.15983271371798427 0)
        (0.3090497913836753 -0.15998723249461305 0)
        (0.3473759042019821 -0.15953925294999985 0)
        (0.38648542455413964 -0.15853051680680608 0)
        (0.4261637027198844 -0.1570120011394939 0)
        (0.4661905065851669 -0.1550369824710317 0)
        (0.5063445712881329 -0.15266052912327815 0)
        (0.5463966632091495 -0.1499388640978723 0)
        (0.5861168204875074 -0.14692947582452454 0)
        (0.6252848569584759 -0.14368779884366695 0)
        (0.6636720264368968 -0.1402652178090582 0)
        (0.7010575694478306 -0.1367149195258468 0)
        (0.7372233052489358 -0.1330855335332995 0)
        (0.7719572014790398 -0.12942501909018822 0)
        (0.8050571137175911 -0.12577985881701012 0)
        (0.8363230198538433 -0.12219403580885412 0)
        (0.8655619279507976 -0.11871430960844863 0)
        (0.8926019195905769 -0.11538635679878212 0)
        (0.9172764043389225 -0.11225248945563272 0)
        (0.939427066261318 -0.1093583028381417 0)
        (0.9589179755243136 -0.10674710704604935 0)
        (0.9756316494942634 -0.10445725929283352 0)
        (0.9894516682899617 -0.10252691308011815 0)
        (1.0002923258687864 -0.10098991594355965 0)
        (1.0080854801639092 -0.09987170641665973 0)
        (1.012763245739645 -0.09919565530504099 0)
    )
    polyLine 36 32
    (
        (0.27171768195822754 -0.15983271371798427 1)
        (0.3090497913836753 -0.15998723249461305 1)
        (0.3473759042019821 -0.15953925294999985 1)
        (0.38648542455413964 -0.15853051680680608 1)
        (0.4261637027198844 -0.1570120011394939 1)
        (0.4661905065851669 -0.1550369824710317 1)
        (0.5063445712881329 -0.15266052912327815 1)
        (0.5463966632091495 -0.1499388640978723 1)
        (0.5861168204875074 -0.14692947582452454 1)
        (0.6252848569584759 -0.14368779884366695 1)
        (0.6636720264368968 -0.1402652178090582 1)
        (0.7010575694478306 -0.1367149195258468 1)
        (0.7372233052489358 -0.1330855335332995 1)
        (0.7719572014790398 -0.12942501909018822 1)
        (0.8050571137175911 -0.12577985881701012 1)
        (0.8363230198538433 -0.12219403580885412 1)
        (0.8655619279507976 -0.11871430960844863 1)
        (0.8926019195905769 -0.11538635679878212 1)
        (0.9172764043389225 -0.11225248945563272 1)
        (0.939427066261318 -0.1093583028381417 1)
        (0.9589179755243136 -0.10674710704604935 1)
        (0.9756316494942634 -0.10445725929283352 1)
        (0.9894516682899617 -0.10252691308011815 1)
        (1.0002923258687864 -0.10098991594355965 1)
        (1.0080854801639092 -0.09987170641665973 1)
        (1.012763245739645 -0.09919565530504099 1)
    )
    spline 12 15
    (
        (0.998459 0.000224 0)
        (0.993844 0.000891 0)
        (0.986185 0.00199 0)
        (0.975528 0.003501 0)
        (0.96194 0.005399 0)
        (0.945503 0.007651 0)
        (0.92632 0.010221 0)
        (0.904508 0.013071 0)
        (0.880203 0.016158 0)
        (0.853553 0.019438 0)
        (0.824724 0.022869 0)
        (0.793893 0.026405 0)
        (0.761249 0.03 0)
        (0.726995 0.03361 0)
        (0.691342 0.037188 0)
        (0.654508 0.040686 0)
        (0.616723 0.044055 0)
        (0.578217 0.047242 0)
        (0.53923 0.050196 0)
        (0.5 0.052862 0)
        (0.46077 0.055184 0)
        (0.421783 0.057108 0)
        (0.383277 0.058582 0)
        (0.345492 0.059557 0)
        (0.308658 0.059988 0)
        (0.273005 0.059841 0)
    )
    spline 31 34
    (
        (0.998459 0.000224 1)
        (0.993844 0.000891 1)
        (0.986185 0.00199 1)
        (0.975528 0.003501 1)
        (0.96194 0.005399 1)
        (0.945503 0.007651 1)
        (0.92632 0.010221 1)
        (0.904508 0.013071 1)
        (0.880203 0.016158 1)
        (0.853553 0.019438 1)
        (0.824724 0.022869 1)
        (0.793893 0.026405 1)
        (0.761249 0.03 1)
        (0.726995 0.03361 1)
        (0.691342 0.037188 1)
        (0.654508 0.040686 1)
        (0.616723 0.044055 1)
        (0.578217 0.047242 1)
        (0.53923 0.050196 1)
        (0.5 0.052862 1)
        (0.46077 0.055184 1)
        (0.421783 0.057108 1)
        (0.383277 0.058582 1)
        (0.345492 0.059557 1)
        (0.308658 0.059988 1)
        (0.273005 0.059841 1)
    )
    arc 4 5 (-7.071072502792263 7.071063120935576 0)
    arc 3 4 (-7.071072502792263 -7.071063120935576 0)
    arc 23 24 (-7.071072502792263 7.071063120935576 1)
    arc 22 23 (-7.071072502792263 -7.071063120935576 1)
    spline 15 0
    (
        (0.238751 0.059088 0)
        (0.206107 0.057712 0)
        (0.175276 0.055708 0)
        (0.146447 0.053083 0)
        (0.119797 0.049854 0)
        (0.095492 0.046049 0)
        (0.07368 0.041705 0)
        (0.054497 0.036867 0)
        (0.03806 0.03158 0)
        (0.024472 0.025893 0)
        (0.013815 0.019854 0)
        (0.006156 0.013503 0)
        (0.001541 0.006877 0)
        (0.0 0.0 0)
    )
    spline 34 19
    (
        (0.238751 0.059088 1)
        (0.206107 0.057712 1)
        (0.175276 0.055708 1)
        (0.146447 0.053083 1)
        (0.119797 0.049854 1)
        (0.095492 0.046049 1)
        (0.07368 0.041705 1)
        (0.054497 0.036867 1)
        (0.03806 0.03158 1)
        (0.024472 0.025893 1)
        (0.013815 0.019854 1)
        (0.006156 0.013503 1)
        (0.001541 0.006877 1)
        (0.0 0.0 1)
    )
    spline 0 16
    (
        (0.001541 -0.006877 0)
        (0.006156 -0.013503 0)
        (0.013815 -0.019854 0)
        (0.024472 -0.025893 0)
        (0.03806 -0.03158 0)
        (0.054497 -0.036867 0)
        (0.07368 -0.041705 0)
        (0.095492 -0.046049 0)
        (0.119797 -0.049854 0)
        (0.146447 -0.053083 0)
        (0.175276 -0.055708 0)
        (0.206107 -0.057712 0)
        (0.238751 -0.059088 0)
    )
    spline 19 35
    (
        (0.001541 -0.006877 1)
        (0.006156 -0.013503 1)
        (0.013815 -0.019854 1)
        (0.024472 -0.025893 1)
        (0.03806 -0.03158 1)
        (0.054497 -0.036867 1)
        (0.07368 -0.041705 1)
        (0.095492 -0.046049 1)
        (0.119797 -0.049854 1)
        (0.146447 -0.053083 1)
        (0.175276 -0.055708 1)
        (0.206107 -0.057712 1)
        (0.238751 -0.059088 1)
    )
    spline 16 12
    (
        (0.273005 -0.059841 0)
        (0.308658 -0.059988 0)
        (0.345492 -0.059557 0)
        (0.383277 -0.058582 0)
        (0.421783 -0.057108 0)
        (0.46077 -0.055184 0)
        (0.5 -0.052862 0)
        (0.53923 -0.050196 0)
        (0.578217 -0.047242 0)
        (0.616723 -0.044055 0)
        (0.654508 -0.040686 0)
        (0.691342 -0.037188 0)
        (0.726995 -0.03361 0)
        (0.761249 -0.03 0)
        (0.793893 -0.026405 0)
        (0.824724 -0.022869 0)
        (0.853553 -0.019438 0)
        (0.880203 -0.016158 0)
        (0.904508 -0.013071 0)
        (0.92632 -0.010221 0)
        (0.945503 -0.007651 0)
        (0.96194 -0.005399 0)
        (0.975528 -0.003501 0)
        (0.986185 -0.00199 0)
        (0.993844 -0.000891 0)
        (0.998459 -0.000224 0)
    )
    spline 35 31
    (
        (0.273005 -0.059841 1)
        (0.308658 -0.059988 1)
        (0.345492 -0.059557 1)
        (0.383277 -0.058582 1)
        (0.421783 -0.057108 1)
        (0.46077 -0.055184 1)
        (0.5 -0.052862 1)
        (0.53923 -0.050196 1)
        (0.578217 -0.047242 1)
        (0.616723 -0.044055 1)
        (0.654508 -0.040686 1)
        (0.691342 -0.037188 1)
        (0.726995 -0.03361 1)
        (0.761249 -0.03 1)
        (0.793893 -0.026405 1)
        (0.824724 -0.022869 1)
        (0.853553 -0.019438 1)
        (0.880203 -0.016158 1)
        (0.904508 -0.013071 1)
        (0.92632 -0.010221 1)
        (0.945503 -0.007651 1)
        (0.96194 -0.005399 1)
        (0.975528 -0.003501 1)
        (0.986185 -0.00199 1)
        (0.993844 -0.000891 1)
        (0.998459 -0.000224 1)
    )
);

boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
          (1 2 13 10)
          (2 3 17 13)
          (3 4 18 17)
          (18 4 5 14)
          (11 14 5 6)
          (8 11 6 7)
          (9 12 11 8)
          (12 15 14 11)
          (0 18 14 15)
          (17 18 0 16)
          (13 17 16 12)
          (10 13 12 9)
          (21 20 29 32)
          (22 21 32 36)
          (23 22 36 37)
          (23 37 33 24)
          (33 30 25 24)
          (30 27 26 25)
          (31 28 27 30)
          (34 31 30 33)
          (37 19 34 33)
          (37 36 35 19)
          (36 32 31 35)
          (32 29 28 31)
         );
     }
    farfield
    {
        type patch;
        faces
        (
          (4 23 24 5)
          (5 24 25 6)
          (6 25 26 7)
          (27 8 7 26)
          (28 9 8 27)
          (29 10 9 28)
          (20 1 10 29)
          (21 2 1 20)
          (22 3 2 21)
          (23 4 3 22)
         );
     }
    airfoil
    {
        type wall;
        faces
        (
          (34 15 12 31)
          (19 0 15 34)
          (0 19 35 16)
          (16 35 31 12)
         );
     }
);
